app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price", "published_date") VALUES ('Lord of the Rings 2', '2026-01-28 03:46:16.674650', '2026-01-28 03:46:16.674650', 'Tolkein', 10.0, '2021-04-11') RETURNING "id"

    def set_book
      @book = Book.find(params.expect(:id))
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1